{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[BOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[EOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": {
        "type": "NFKC"
    },
    "pre_tokenizer": {
        "type": "WhitespaceSplit"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": null,
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "ignore_merges": false,
        "vocab": {
            "[BOS]": 0,
            "[EOS]": 1,
            "0": 2,
            "1": 3,
            "2": 4,
            "3": 5,
            "4": 6,
            "5": 7,
            "6": 8,
            "7": 9,
            "8": 10,
            "9": 11,
            ";": 12,
            "<": 13,
            "=": 14,
            ">": 15,
            "?": 16,
            "@": 17,
            "A": 18,
            "B": 19,
            "C": 20,
            "D": 21,
            "E": 22,
            "F": 23,
            "G": 24,
            "H": 25,
            "I": 26,
            "J": 27,
            "K": 28,
            "L": 29,
            "M": 30,
            "N": 31,
            "O": 32,
            "P": 33,
            "Q": 34,
            "R": 35,
            "S": 36,
            "T": 37,
            "U": 38,
            "V": 39,
            "W": 40,
            "X": 41,
            "Y": 42,
            "Z": 43,
            "[": 44,
            "\\": 45,
            "]": 46,
            "^": 47,
            "_": 48,
            "`": 49,
            "a": 50,
            "b": 51,
            "c": 52,
            "d": 53,
            "e": 54,
            "f": 55,
            "g": 56,
            "h": 57,
            "i": 58,
            "j": 59,
            "k": 60,
            "l": 61,
            "m": 62,
            "o": 63,
            "p": 64,
            "q": 65,
            "r": 66,
            "s": 67,
            "t": 68,
            "u": 69,
            "v": 70,
            "w": 71,
            "x": 72,
            "y": 73,
            "z": 74,
            "~": 75,
            "OS": 76,
            "01": 77,
            "02": 78,
            "03": 79,
            "04": 80,
            "05": 81,
            "06": 82,
            "07": 83,
            "08": 84,
            "09": 85,
            "10": 86,
            "11": 87,
            "12": 88,
            "13": 89,
            "14": 90,
            "15": 91,
            "16": 92,
            "17": 93,
            "18": 94,
            "19": 95,
            "20": 96,
            "21": 97,
            "22": 98,
            "23": 99,
            "24": 100,
            "25": 101,
            "26": 102,
            "27": 103,
            "28": 104,
            "29": 105,
            "30": 106,
            "31": 107,
            "32": 108,
            "33": 109,
            "34": 110,
            "35": 111,
            "36": 112,
            "37": 113,
            "38": 114,
            "39": 115,
            "40": 116,
            "41": 117,
            "42": 118,
            "43": 119,
            "44": 120,
            "45": 121,
            "46": 122,
            "47": 123,
            "48": 124,
            "49": 125,
            "50": 126,
            "51": 127,
            "52": 128,
            "53": 129,
            "54": 130,
            "55": 131,
            "56": 132,
            "57": 133,
            "58": 134,
            "59": 135,
            "60": 136,
            "61": 137,
            "62": 138,
            "63": 139,
            "[B": 140,
            "[E": 141
        },
        "merges": [
            [
                "O",
                "S"
            ],
            [
                "0",
                "1"
            ],
            [
                "0",
                "2"
            ],
            [
                "0",
                "3"
            ],
            [
                "0",
                "4"
            ],
            [
                "0",
                "5"
            ],
            [
                "0",
                "6"
            ],
            [
                "0",
                "7"
            ],
            [
                "0",
                "8"
            ],
            [
                "0",
                "9"
            ],
            [
                "1",
                "0"
            ],
            [
                "1",
                "1"
            ],
            [
                "1",
                "2"
            ],
            [
                "1",
                "3"
            ],
            [
                "1",
                "4"
            ],
            [
                "1",
                "5"
            ],
            [
                "1",
                "6"
            ],
            [
                "1",
                "7"
            ],
            [
                "1",
                "8"
            ],
            [
                "1",
                "9"
            ],
            [
                "2",
                "0"
            ],
            [
                "2",
                "1"
            ],
            [
                "2",
                "2"
            ],
            [
                "2",
                "3"
            ],
            [
                "2",
                "4"
            ],
            [
                "2",
                "5"
            ],
            [
                "2",
                "6"
            ],
            [
                "2",
                "7"
            ],
            [
                "2",
                "8"
            ],
            [
                "2",
                "9"
            ],
            [
                "3",
                "0"
            ],
            [
                "3",
                "1"
            ],
            [
                "3",
                "2"
            ],
            [
                "3",
                "3"
            ],
            [
                "3",
                "4"
            ],
            [
                "3",
                "5"
            ],
            [
                "3",
                "6"
            ],
            [
                "3",
                "7"
            ],
            [
                "3",
                "8"
            ],
            [
                "3",
                "9"
            ],
            [
                "4",
                "0"
            ],
            [
                "4",
                "1"
            ],
            [
                "4",
                "2"
            ],
            [
                "4",
                "3"
            ],
            [
                "4",
                "4"
            ],
            [
                "4",
                "5"
            ],
            [
                "4",
                "6"
            ],
            [
                "4",
                "7"
            ],
            [
                "4",
                "8"
            ],
            [
                "4",
                "9"
            ],
            [
                "5",
                "0"
            ],
            [
                "5",
                "1"
            ],
            [
                "5",
                "2"
            ],
            [
                "5",
                "3"
            ],
            [
                "5",
                "4"
            ],
            [
                "5",
                "5"
            ],
            [
                "5",
                "6"
            ],
            [
                "5",
                "7"
            ],
            [
                "5",
                "8"
            ],
            [
                "5",
                "9"
            ],
            [
                "6",
                "0"
            ],
            [
                "6",
                "1"
            ],
            [
                "6",
                "2"
            ],
            [
                "6",
                "3"
            ],
            [
                "[",
                "B"
            ],
            [
                "[",
                "E"
            ]
        ]
    }
}