{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "7": 9,
      "8": 10,
      "9": 11,
      ";": 12,
      "<": 13,
      "=": 14,
      ">": 15,
      "?": 16,
      "@": 17,
      "A": 18,
      "B": 19,
      "C": 20,
      "D": 21,
      "E": 22,
      "F": 23,
      "H": 24,
      "I": 25,
      "J": 26,
      "K": 27,
      "L": 28,
      "M": 29,
      "N": 30,
      "O": 31,
      "P": 32,
      "Q": 33,
      "R": 34,
      "S": 35,
      "T": 36,
      "U": 37,
      "V": 38,
      "W": 39,
      "X": 40,
      "Y": 41,
      "Z": 42,
      "[": 43,
      "\\": 44,
      "]": 45,
      "_": 46,
      "`": 47,
      "a": 48,
      "b": 49,
      "c": 50,
      "d": 51,
      "e": 52,
      "f": 53,
      "h": 54,
      "i": 55,
      "j": 56,
      "o": 57,
      "p": 58,
      "q": 59,
      "r": 60,
      "s": 61,
      "t": 62,
      "u": 63,
      "v": 64,
      "x": 65,
      "y": 66,
      "z": 67,
      "~": 68,
      "OS": 69,
      "OS]": 70,
      "00": 71,
      "01": 72,
      "02": 73,
      "03": 74,
      "04": 75,
      "05": 76,
      "06": 77,
      "07": 78,
      "08": 79,
      "09": 80,
      "10": 81,
      "11": 82,
      "12": 83,
      "13": 84,
      "14": 85,
      "15": 86,
      "16": 87,
      "17": 88,
      "18": 89,
      "19": 90,
      "20": 91,
      "21": 92,
      "BOS]": 93
    },
    "merges": [
      [
        "O",
        "S"
      ],
      [
        "OS",
        "]"
      ],
      [
        "0",
        "0"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "2"
      ],
      [
        "0",
        "3"
      ],
      [
        "0",
        "4"
      ],
      [
        "0",
        "5"
      ],
      [
        "0",
        "6"
      ],
      [
        "0",
        "7"
      ],
      [
        "0",
        "8"
      ],
      [
        "0",
        "9"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        "3"
      ],
      [
        "1",
        "4"
      ],
      [
        "1",
        "5"
      ],
      [
        "1",
        "6"
      ],
      [
        "1",
        "7"
      ],
      [
        "1",
        "8"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "0"
      ],
      [
        "2",
        "1"
      ],
      [
        "B",
        "OS]"
      ]
    ]
  }
}