{"version":"1.0","truncation":null,"padding":null,"added_tokens":[],"normalizer":{"type":"NFKC"},"pre_tokenizer":{"type":"WhitespaceSplit"},"post_processor":null,"decoder":null,"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"0":0,"1":1,"2":2,"3":3,"4":4,"5":5,"6":6,"7":7,"8":8,"9":9,";":10,"<":11,"=":12,">":13,"?":14,"@":15,"A":16,"B":17,"C":18,"D":19,"E":20,"F":21,"G":22,"H":23,"I":24,"J":25,"K":26,"L":27,"M":28,"N":29,"O":30,"P":31,"Q":32,"R":33,"S":34,"T":35,"U":36,"V":37,"W":38,"X":39,"Y":40,"Z":41,"[":42,"\\":43,"]":44,"^":45,"_":46,"`":47,"a":48,"b":49,"c":50,"d":51,"e":52,"f":53,"g":54,"h":55,"i":56,"j":57,"k":58,"l":59,"m":60,"n":61,"o":62,"p":63,"q":64,"r":65,"s":66,"t":67,"u":68,"v":69,"w":70,"x":71,"y":72,"z":73,"~":74,"00":75,"01":76,"02":77,"03":78,"04":79,"05":80,"06":81,"07":82,"08":83,"09":84,"10":85,"11":86,"12":87,"13":88,"14":89,"15":90,"16":91,"17":92,"18":93,"19":94,"20":95,"21":96,"22":97,"23":98,"24":99,"25":100,"26":101,"27":102,"28":103,"29":104,"30":105,"31":106,"32":107,"33":108,"34":109,"35":110,"36":111,"37":112,"38":113,"39":114,"40":115,"41":116,"42":117,"43":118,"44":119,"45":120,"46":121,"47":122,"48":123,"49":124,"50":125,"51":126,"52":127,"53":128,"54":129,"55":130,"56":131,"57":132,"58":133,"59":134,"60":135,"61":136,"62":137,"63":138},"merges":["0 0","0 1","0 2","0 3","0 4","0 5","0 6","0 7","0 8","0 9","1 0","1 1","1 2","1 3","1 4","1 5","1 6","1 7","1 8","1 9","2 0","2 1","2 2","2 3","2 4","2 5","2 6","2 7","2 8","2 9","3 0","3 1","3 2","3 3","3 4","3 5","3 6","3 7","3 8","3 9","4 0","4 1","4 2","4 3","4 4","4 5","4 6","4 7","4 8","4 9","5 0","5 1","5 2","5 3","5 4","5 5","5 6","5 7","5 8","5 9","6 0","6 1","6 2","6 3"]}}