{
  "backend": "tokenizers",
  "bos_token": "[BOS]",
  "eos_token": "[EOS]",
  "is_local": true,
  "local_files_only": false,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[PAD]",
  "tokenizer_class": "TokenizersBackend"
}
