{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "[PAD]": 2,
      "~": 3,
      ";": 4,
      "z": 5,
      "y": 6,
      "P": 7,
      "x": 8,
      "t": 9,
      "O": 10,
      "e": 11,
      "_": 12,
      "d": 13,
      "o": 14,
      "s": 15,
      "a": 16,
      "u": 17,
      "p": 18,
      "`": 19,
      "V": 20,
      "w": 21,
      "f": 22,
      "v": 23,
      "Q": 24,
      "c": 25,
      "U": 26,
      "[": 27,
      "j": 28,
      "K": 29,
      "@": 30,
      "A": 31,
      "S": 32,
      "<": 33,
      "T": 34,
      "h": 35,
      "L": 36,
      "?": 37,
      "k": 38,
      "q": 39,
      "i": 40,
      "Z": 41,
      "g": 42,
      "Y": 43,
      "B": 44,
      "b": 45,
      "\\": 46,
      "R": 47,
      "r": 48,
      "D": 49,
      "X": 50,
      "F": 51,
      "M": 52,
      "C": 53,
      "]": 54,
      "E": 55,
      "l": 56,
      "W": 57,
      "00": 58,
      "01": 59,
      "02": 60,
      "03": 61,
      "04": 62,
      "05": 63,
      "06": 64,
      "07": 65,
      "08": 66,
      "09": 67,
      "10": 68,
      "11": 69,
      "12": 70,
      "13": 71,
      "14": 72,
      "15": 73,
      "16": 74,
      "17": 75,
      "18": 76,
      "19": 77,
      "20": 78,
      "21": 79,
      "22": 80,
      "23": 81,
      "24": 82,
      "25": 83,
      "26": 84,
      "27": 85,
      "28": 86,
      "29": 87,
      "30": 88,
      "31": 89,
      "32": 90,
      "33": 91,
      "34": 92,
      "35": 93,
      "36": 94,
      "37": 95,
      "38": 96,
      "39": 97,
      "40": 98,
      "41": 99,
      "42": 100,
      "43": 101,
      "44": 102,
      "45": 103,
      "46": 104,
      "47": 105,
      "48": 106,
      "49": 107,
      "50": 108,
      "51": 109,
      "52": 110,
      "53": 111,
      "54": 112,
      "55": 113,
      "56": 114,
      "57": 115,
      "58": 116,
      "59": 117,
      "60": 118,
      "61": 119,
      "62": 120,
      "63": 121,
      "=": 122,
      "^": 123,
      "N": 124,
      ">": 125,
      "G": 126,
      "H": 127,
      "I": 128
    },
    "unk_token": "<unk>"
  }
}