{
  "backend": "tokenizers",
  "bos_token": "[BOS]",
  "eos_token": "[EOS]",
  "extra_special_tokens": [
    "[ROW_00]",
    "[ROW_01]",
    "[ROW_02]",
    "[ROW_03]",
    "[ROW_04]",
    "[ROW_05]",
    "[ROW_06]",
    "[ROW_07]",
    "[ROW_08]",
    "[ROW_09]",
    "[ROW_10]",
    "[ROW_11]",
    "[ROW_12]",
    "[ROW_13]",
    "[ROW_14]",
    "[ROW_15]",
    "[ROW_16]",
    "[ROW_17]",
    "[ROW_18]",
    "[ROW_19]",
    "[ROW_20]",
    "[ROW_21]",
    "[ROW_22]",
    "[ROW_23]",
    "[ROW_24]",
    "[ROW_25]",
    "[ROW_26]",
    "[ROW_27]",
    "[ROW_28]",
    "[ROW_29]",
    "[ROW_30]",
    "[ROW_31]",
    "[ROW_32]",
    "[ROW_33]",
    "[ROW_34]",
    "[ROW_35]",
    "[ROW_36]",
    "[ROW_37]",
    "[ROW_38]",
    "[ROW_39]",
    "[ROW_40]",
    "[ROW_41]",
    "[ROW_42]",
    "[ROW_43]",
    "[ROW_44]",
    "[ROW_45]",
    "[ROW_46]",
    "[ROW_47]",
    "[ROW_48]",
    "[ROW_49]",
    "[ROW_50]",
    "[ROW_51]",
    "[ROW_52]",
    "[ROW_53]",
    "[ROW_54]",
    "[ROW_55]",
    "[ROW_56]",
    "[ROW_57]",
    "[ROW_58]",
    "[ROW_59]",
    "[ROW_60]",
    "[ROW_61]",
    "[ROW_62]",
    "[ROW_63]"
  ],
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[PAD]",
  "tokenizer_class": "TokenizersBackend",
  "unk_token": "[UNK]"
}
