{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "[PAD]": 2,
      "~": 3,
      ";": 4,
      "P": 5,
      "z": 6,
      "x": 7,
      "y": 8,
      "_": 9,
      "t": 10,
      "O": 11,
      "e": 12,
      "d": 13,
      "a": 14,
      "K": 15,
      "u": 16,
      "o": 17,
      "c": 18,
      "v": 19,
      "s": 20,
      "p": 21,
      "w": 22,
      "`": 23,
      "i": 24,
      "Q": 25,
      "q": 26,
      "[": 27,
      "T": 28,
      "f": 29,
      "\\": 30,
      "S": 31,
      "?": 32,
      "U": 33,
      "k": 34,
      "r": 35,
      "L": 36,
      "j": 37,
      "b": 38,
      "<": 39,
      "@": 40,
      "g": 41,
      "l": 42,
      "C": 43,
      "X": 44,
      "00": 45,
      "01": 46,
      "02": 47,
      "03": 48,
      "04": 49,
      "05": 50,
      "06": 51,
      "07": 52,
      "08": 53,
      "09": 54,
      "10": 55,
      "11": 56,
      "12": 57,
      "13": 58,
      "14": 59,
      "15": 60,
      "16": 61,
      "17": 62,
      "18": 63,
      "19": 64,
      "20": 65,
      "21": 66,
      "22": 67,
      "23": 68,
      "24": 69,
      "25": 70,
      "26": 71,
      "27": 72,
      "28": 73,
      "29": 74,
      "30": 75,
      "31": 76,
      "32": 77,
      "33": 78,
      "34": 79,
      "35": 80,
      "36": 81,
      "37": 82,
      "38": 83,
      "39": 84,
      "40": 85,
      "41": 86,
      "42": 87,
      "43": 88,
      "44": 89,
      "45": 90,
      "46": 91,
      "47": 92,
      "48": 93,
      "49": 94,
      "50": 95,
      "51": 96,
      "52": 97,
      "53": 98,
      "54": 99,
      "55": 100,
      "56": 101,
      "57": 102,
      "58": 103,
      "59": 104,
      "60": 105,
      "61": 106,
      "62": 107,
      "63": 108,
      "Y": 109,
      "H": 110,
      "h": 111
    },
    "unk_token": "<unk>"
  }
}