{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 111,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[BOS]": 0,
      "[PAD]": 2,
      "~": 3,
      "j": 4,
      ";": 5,
      "z": 6,
      "w": 7,
      "y": 8,
      "t": 9,
      "x": 10,
      "e": 11,
      "d": 12,
      "P": 13,
      "_": 14,
      "s": 15,
      "O": 16,
      "f": 17,
      "a": 18,
      "v": 19,
      "`": 20,
      "Q": 21,
      "T": 22,
      "K": 23,
      "o": 24,
      "[": 25,
      "u": 26,
      "?": 27,
      "L": 28,
      "r": 29,
      "U": 30,
      "i": 31,
      "V": 32,
      "h": 33,
      "p": 34,
      "S": 35,
      "@": 36,
      "g": 37,
      "\\": 38,
      "A": 39,
      "c": 40,
      "E": 41,
      "l": 42,
      "=": 43,
      "Z": 44,
      "D": 45,
      "Y": 46,
      "00": 47,
      "01": 48,
      "02": 49,
      "03": 50,
      "04": 51,
      "05": 52,
      "06": 53,
      "07": 54,
      "08": 55,
      "09": 56,
      "10": 57,
      "11": 58,
      "12": 59,
      "13": 60,
      "14": 61,
      "15": 62,
      "16": 63,
      "17": 64,
      "18": 65,
      "19": 66,
      "20": 67,
      "21": 68,
      "22": 69,
      "23": 70,
      "24": 71,
      "25": 72,
      "26": 73,
      "27": 74,
      "28": 75,
      "29": 76,
      "30": 77,
      "31": 78,
      "32": 79,
      "33": 80,
      "34": 81,
      "35": 82,
      "36": 83,
      "37": 84,
      "38": 85,
      "39": 86,
      "40": 87,
      "41": 88,
      "42": 89,
      "43": 90,
      "44": 91,
      "45": 92,
      "46": 93,
      "47": 94,
      "48": 95,
      "49": 96,
      "50": 97,
      "51": 98,
      "52": 99,
      "53": 100,
      "54": 101,
      "55": 102,
      "56": 103,
      "57": 104,
      "58": 105,
      "59": 106,
      "60": 107,
      "61": 108,
      "62": 109,
      "63": 110,
      "[EOS]": 111,
      "M": 112,
      "<": 113,
      "R": 114,
      "k": 115
    },
    "unk_token": "<unk>"
  }
}