{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "[PAD]": 2,
      "~": 3,
      "R": 4,
      "O": 5,
      "V": 6,
      "A": 7,
      ";": 8,
      "j": 9,
      "_": 10,
      "Z": 11,
      "00": 12,
      "F": 13,
      "c": 14,
      "z": 15
    },
    "unk_token": "<unk>"
  }
}