{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[BOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[EOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 3,
            "content": "[PAD]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": {
        "type": "NFKC"
    },
    "pre_tokenizer": {
        "type": "WhitespaceSplit"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": null,
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "ignore_merges": false,
        "vocab": {
            "[BOS]": 0,
            "[EOS]": 1,
            "[UNK]": 2,
            "[PAD]": 3,
            "0": 4,
            "1": 5,
            "2": 6,
            "3": 7,
            "4": 8,
            "5": 9,
            "6": 10,
            "7": 11,
            "8": 12,
            "9": 13,
            ";": 14,
            "<": 15,
            "=": 16,
            ">": 17,
            "?": 18,
            "@": 19,
            "A": 20,
            "B": 21,
            "C": 22,
            "D": 23,
            "E": 24,
            "F": 25,
            "G": 26,
            "H": 27,
            "I": 28,
            "J": 29,
            "K": 30,
            "L": 31,
            "M": 32,
            "N": 33,
            "O": 34,
            "P": 35,
            "Q": 36,
            "R": 37,
            "S": 38,
            "T": 39,
            "U": 40,
            "V": 41,
            "W": 42,
            "X": 43,
            "Y": 44,
            "Z": 45,
            "[": 46,
            "\\": 47,
            "]": 48,
            "^": 49,
            "_": 50,
            "`": 51,
            "a": 52,
            "b": 53,
            "c": 54,
            "d": 55,
            "e": 56,
            "f": 57,
            "g": 58,
            "h": 59,
            "i": 60,
            "j": 61,
            "k": 62,
            "l": 63,
            "m": 64,
            "o": 65,
            "p": 66,
            "q": 67,
            "r": 68,
            "s": 69,
            "t": 70,
            "u": 71,
            "v": 72,
            "w": 73,
            "x": 74,
            "y": 75,
            "z": 76,
            "~": 77,
            "OS": 78,
            "01": 79,
            "02": 80,
            "03": 81,
            "04": 82,
            "05": 83,
            "06": 84,
            "07": 85,
            "08": 86,
            "09": 87,
            "10": 88,
            "11": 89,
            "12": 90,
            "13": 91,
            "14": 92,
            "15": 93,
            "16": 94,
            "17": 95,
            "18": 96,
            "19": 97,
            "20": 98,
            "21": 99,
            "22": 100,
            "23": 101,
            "24": 102,
            "25": 103,
            "26": 104,
            "27": 105,
            "28": 106,
            "29": 107,
            "30": 108,
            "31": 109,
            "32": 110,
            "33": 111,
            "34": 112,
            "35": 113,
            "36": 114,
            "37": 115,
            "38": 116,
            "39": 117,
            "40": 118,
            "41": 119,
            "42": 120,
            "43": 121,
            "44": 122,
            "45": 123,
            "46": 124,
            "47": 125,
            "48": 126,
            "49": 127,
            "50": 128,
            "51": 129,
            "52": 130,
            "53": 131,
            "54": 132,
            "55": 133,
            "56": 134,
            "57": 135,
            "58": 136,
            "59": 137,
            "60": 138,
            "61": 139,
            "62": 140,
            "63": 141,
            "[B": 142,
            "[E": 143
        },
        "merges": [
            [
                "O",
                "S"
            ],
            [
                "0",
                "1"
            ],
            [
                "0",
                "2"
            ],
            [
                "0",
                "3"
            ],
            [
                "0",
                "4"
            ],
            [
                "0",
                "5"
            ],
            [
                "0",
                "6"
            ],
            [
                "0",
                "7"
            ],
            [
                "0",
                "8"
            ],
            [
                "0",
                "9"
            ],
            [
                "1",
                "0"
            ],
            [
                "1",
                "1"
            ],
            [
                "1",
                "2"
            ],
            [
                "1",
                "3"
            ],
            [
                "1",
                "4"
            ],
            [
                "1",
                "5"
            ],
            [
                "1",
                "6"
            ],
            [
                "1",
                "7"
            ],
            [
                "1",
                "8"
            ],
            [
                "1",
                "9"
            ],
            [
                "2",
                "0"
            ],
            [
                "2",
                "1"
            ],
            [
                "2",
                "2"
            ],
            [
                "2",
                "3"
            ],
            [
                "2",
                "4"
            ],
            [
                "2",
                "5"
            ],
            [
                "2",
                "6"
            ],
            [
                "2",
                "7"
            ],
            [
                "2",
                "8"
            ],
            [
                "2",
                "9"
            ],
            [
                "3",
                "0"
            ],
            [
                "3",
                "1"
            ],
            [
                "3",
                "2"
            ],
            [
                "3",
                "3"
            ],
            [
                "3",
                "4"
            ],
            [
                "3",
                "5"
            ],
            [
                "3",
                "6"
            ],
            [
                "3",
                "7"
            ],
            [
                "3",
                "8"
            ],
            [
                "3",
                "9"
            ],
            [
                "4",
                "0"
            ],
            [
                "4",
                "1"
            ],
            [
                "4",
                "2"
            ],
            [
                "4",
                "3"
            ],
            [
                "4",
                "4"
            ],
            [
                "4",
                "5"
            ],
            [
                "4",
                "6"
            ],
            [
                "4",
                "7"
            ],
            [
                "4",
                "8"
            ],
            [
                "4",
                "9"
            ],
            [
                "5",
                "0"
            ],
            [
                "5",
                "1"
            ],
            [
                "5",
                "2"
            ],
            [
                "5",
                "3"
            ],
            [
                "5",
                "4"
            ],
            [
                "5",
                "5"
            ],
            [
                "5",
                "6"
            ],
            [
                "5",
                "7"
            ],
            [
                "5",
                "8"
            ],
            [
                "5",
                "9"
            ],
            [
                "6",
                "0"
            ],
            [
                "6",
                "1"
            ],
            [
                "6",
                "2"
            ],
            [
                "6",
                "3"
            ],
            [
                "[",
                "B"
            ],
            [
                "[",
                "E"
            ]
        ]
    }
}